Repository: thlabbe/sicp-fr
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: (* 5 size)
fr_fr: (* 5 taille)

source: (* pi (* radius radius))
fr_fr: (* pi (* rayon rayon))

source: (+ (square 6) (square 10))
fr_fr: (+ (carré 6) (carré 10))

source: (+ (square x) (square y))
fr_fr: (+ (carré x) (carré y))

source: (+ (square x) (square y)))
fr_fr: (+ (carré x) (carré y)))

source: (+ (square (+ 5 1)) (square (* 5 2)) )
fr_fr: (+ (carré (+ 5 1)) (carré (* 5 2)) )

source: (Later we will discover that they are really not so distinct.) Informally, data is ``stuff'' that we want to manipulate, and procedures are descriptions of the rules for manipulating the data.
fr_fr: (Nous découvrirons plus tard que ces deux types d'éléments ne sont pas si distincts que ça.) De manière informelle, les données sont les « trucs » que nous voulons manipuler et les procédures sont des descriptions des règles de manipulation des données.

source: (More precisely, the expression that you type consists of the numerals that represent the number in base 10.) If you present Lisp with a number
fr_fr: (Ou plus précisément, l'expression saisie est le signe qui représente le nombre en base 10.) Si vous présentez à Lisp un nombre

source: (See exercise 1.5 for an instance of an ``illegitimate'' value where normal-order and applicative-order evaluation do not give the same result.)
fr_fr: (Voir l'exercice 1.5 pour un exemple de valeur « illégitime » où les deux types d'évaluation ne produisent pas le même résultat.)

source: (That is, (define x 3) is not a combination.)
fr_fr: (En d'autres termes, (define x 3) n'est pas une combinaison).

source: (define (<name> <formal parameters>) <body>)
fr_fr: (define (<nom> <paramètres formels>) <corps>)

source: (define (square x) (* x x))
fr_fr: (define (carré x) (* x x))

source: (define (sum-of-squares x y)
fr_fr: (define (somme-de-carrés x y)

source: (define circumference (* 2 pi radius))
fr_fr: (define circonference (* 2 pi rayon))

source: (define radius 10)
fr_fr: (define rayon 10)

source: (define size 2)
fr_fr: (define taille 2)

source: (if <predicate> <consequent> <alternative>)
fr_fr: (if <proposition> <conséquence> <alternative>)

source: (square (+ 2 5))
fr_fr: (carré (+ 2 5))

source: (square (square 3))
fr_fr: (carré (carré 3))

source: (square 21)
fr_fr: (carré 21)

source: (sum-of-squares (+ 5 1) (* 5 2))
fr_fr: (somme-de-carrés (+ 5 1) (* 5 2))

source: (sum-of-squares (+ a 1) (* a 2))
fr_fr: (somme-de-carrés (+ a 1) (* a 2)))

source: (sum-of-squares (+ a 1) (* a 2)))
fr_fr: (somme-de-carrés (+ a 1) (* a 2)))

source: (sum-of-squares 3 4)
fr_fr: (somme-de-carrés 3 4)

source: 1.1.2 Naming and the Environment
fr_fr: 1.1.2 Les noms et l'environnement

source: 1.1.3 Evaluating Combinations
fr_fr: 1.1.3 Évaluation de combinaisons

source: 1.1.4 Compound Procedures
fr_fr: 1.1.4 Procédures composées

source: 1.1.5 The Substitution Model for Procedure Application
fr_fr: 1.1.5 Le modèle de substitution pour l'application des procédures

source: 1.1.6 Conditional Expressions and Predicates
fr_fr: 1.1.6 Expressions conditionnelles et propositions

source: 1.1 The Elements of Programming
fr_fr: 1.1 Les éléments de la programmation

source: 1.2 Procedures and the Processes They Generate
fr_fr: 1.2 Procédures et processus générés

source: 1. Evaluate the subexpressions of the combination.
fr_fr: 1. Évaluer les sous-expressions de la combinaison.

source: 2. Apply the procedure that is the value of the leftmost subexpression (the operator) to the arguments that are the values of the other subexpressions (the operands).
fr_fr: 2. Appliquer la procédure qui est la valeur de la sous-expression la plus à gauche (l'opérateur) aux arguments qui sont les valeurs des autres sous-expressions (les opérandes).

source: 1 Building Abstractions with Procedures
fr_fr: 1 Créer des abstractions à l'aide de procédures

source: Acknowledgments
fr_fr: Remerciements

source: Foreword
fr_fr: Avant-propos

source: Preface to the First Edition
fr_fr: Préface à la première édition

source: Preface to the Second Edition
fr_fr: Préface à la seconde édition

source: Each special form has its own evaluation rule.
fr_fr: Chaque forme spéciale a sa propre règle d'évaluation.

source: Evaluating the definition creates this compound procedure and associates it with the name square.12
fr_fr: L'évaluation de la définition créée cette procédure composée et l'associe au nom carré.12

source: Exercise 1.1. Below is a sequence of expressions.
fr_fr: Exercice 1.1. Voici une suite d'expressions.

source: Exercise 1.2. Translate the following expression into prefix form
fr_fr: Exercice 1.2. Traduire les expressions suivantes en notation inversée

source: Exercise 1.3. Define a procedure that takes three numbers as arguments and returns the sum of the squares of the two larger numbers.
fr_fr: Exercice 1.3. Définir une procédure qui prend trois nombres comme argument et qui retourne la somme des carrés des deux nombres les plus grands.

source: Exercise 1.4. Observe that our model of evaluation allows for combinations whose operators are compound expressions.
fr_fr: Exercice 1.4. Observer que notre modèle d'évaluation permet les combinaisons dont les opérateurs sont des expressions composées.

source: Exercise 1.5. Ben Bitdiddle has invented a test to determine whether the interpreter he is faced with is using applicative-order evaluation or normal-order evaluation.
fr_fr: Exercice 1.5. Bernard Bitron a inventé un test pour déterminer si l'interpréteur qu'il utilise évalue selon l'ordre applicatif ou selon l'ordre normal.

source: Figure 1.1: Tree representation, showing the value of each subcombination.
fr_fr: Figure 1.1 : Représentation par arbre, avec la valeur de chaque sous-combinaison.

source: means of abstraction, by which compound elements can be named and manipulated as units.
fr_fr: Les méthodes d'abstraction grâce auxquelles les éléments composés peuvent être nommés et manipulés en tant qu'unités.

source: means of combination, by which compound elements are built from simpler ones, and
fr_fr: Les méthodes de combinaison avec lesquelles les éléments composés sont créés à partir des éléments plus simples, et

source: primitive expressions, which represent the simplest entities the language is concerned with,
fr_fr: Les expressions primitives qui représentent les entités les plus simples que le langage a à considérer,

source: Define is our language's simplest means of abstraction, for it allows us to use simple names to refer to the results of compound operations, such as the circumference computed above.
fr_fr: Define est la méthode d'abstraction la plus simple de notre langage car elle nous permet d'utiliser des noms simples pour faire référence au résultat d'opérations composées, telles que la circonférence calculée plus haut.

source: Define is the only example of a special form that we have seen so far, but we will meet others shortly.
fr_fr: Define est le seul exemple de forme spéciale que nous ayons vu jusqu'ici mais nous en rencontrerons d'autres bientôt.

source: Not is an ordinary procedure.
fr_fr: Not est une procédure normale.

source: A critical aspect of a programming language is the means it provides for using names to refer to computational objects.
fr_fr: Un aspect critique d'un langage de programmation est la méthode qu'il propose pour utiliser des noms pour faire référence à des objets informatiques.

source: A powerful programming language is more than just a means for instructing a computer to perform tasks.
fr_fr: Un langage de programmation puissant est bien plus qu'un moyen de faire effectuer des tâches à un ordinateur.

source: A second advantage of prefix notation is that it extends in a straightforward way to allow combinations to be nested, that is, to have combinations whose elements are themselves combinations:
fr_fr: Un autre avantage de la notation inversée est qu'on peut l'étendre très facilement pour autoriser les emboitements de combinaisons, c'est-à-dire pour avoir des combinaisons dont les éléments sont eux-mêmes des combinaisons :

source: According to the description of evaluation given in section 1.1.3, the interpreter first evaluates the operator and operands and then applies the resulting procedure to the resulting arguments.
fr_fr: D'après la description de l'évaluation donnée dans la section 1.1.3, l'interpréteur évalue en premier l'opérateur et les opérandes puis applique la procédure résultante aux arguments résultats.

source: An alternative evaluation model would not evaluate the operands until their values were needed.
fr_fr: Un modèle alternatif d'évaluation n'évalue par les opérandes avant que leurs valeurs soient requises.

source: Another way to write the absolute-value procedure is
fr_fr: Une autre manière d'écrire la procédure valeur-absolue est

source: Applicative order versus normal order
fr_fr: Ordre d'application et ordre normal

source: As a case in point, let us consider that, in evaluating combinations, the interpreter is itself following a procedure.
fr_fr: Considérons dans notre cas qu'en évaluant des combinaisons l'interpréteur suit lui aussi une procédure.

source: As an example of how these are used, the condition that a number x be in the range 5 < x < 10 may be expressed as
fr_fr: Pour voir comment utiliser ces expressions, voici une manière d'exprimer qu'un nombre x se trouve dans l'intervalle 5 < x < 10

source: As another example, we can define a predicate to test whether one number is greater than or equal to another as
fr_fr: On peut aussi définir une proposition pour vérifier si un nombre est supérieur ou égal à un autre de la manière suivante

source: As we examine things in greater detail, these simple models become inadequate and must be replaced by more refined models.
fr_fr: À l'examen, ces modèles simples se révèlent inadéquat et demandent leur remplacement par des modèles plus rafinés.

source: As we shall see in chapter 3, the general notion of the environment as providing a context in which evaluation takes place will play an important role in our understanding of program execution.
fr_fr: Comme nous le verrons au chapitre 3, la notion d'un environnement en tant que contexte dans lequel l'évaluation a lieu joue un rôle important dans notre compréhension de l'exécution d'un programme.

source: Assume that the sequence is to be evaluated in the order in which it is presented.
fr_fr: Considérons que la suite est évaluée dans l'ordre dans lequel elle est présentée.

source: Cambridge, Massachusetts London, England
fr_fr: Cambridge, Massachusetts Londre, Angleterre

source: Compound procedures are used in exactly the same way as primitive procedures.
fr_fr: Les procédures composées sont utilisées exactement de la même manière que les procédures primitives.

source: Conditional expressions are evaluated as follows.
fr_fr: Les expressions conditionnelles sont évaluées de la manière suivante.

source: Contents
fr_fr: Table des matières

source: Definitions that associate names with values provide a limited means of abstraction.
fr_fr: Les définitions qui associent des noms à des valeurs offrent un moyen limité d'abstraction.

source: Each combination is represented by a node with branches corresponding to the operator and the operands of the combination stemming from it.
fr_fr: Chaque combinaison est représentée par un nœud à partir duquel partent des branches correspondant à l'opérateur et les opérandes de la combinaison.

source: Evaluating this combination involves three subproblems.
fr_fr: L'évaluation de cette combinaison pose trois sous-problèmes.

source: Even this simple rule illustrates some important points about processes in general.
fr_fr: Même cette règle simple illustre quelques points importants au sujet des processus en général.

source: Even with complex expressions, the interpreter always operates in the same basic cycle: It reads an expression from the terminal, evaluates the expression, and prints the result.
fr_fr: Même avec des expressions complexes, l'interpréteur fonctionne toujours selon le même cycle de base : il lit l'expression à partir du terminal, il évalue cette expression et il affiche son résultat.

source: Every powerful language has three mechanisms for accomplishing this:
fr_fr: Tous les langages puissants disposent de trois mécanismes pour ceci :

source: Explain your answer.
fr_fr: Expliquez votre réponse.

source: Expressions representing numbers may be combined with an expression representing a primitive procedure (such as + or *) to form a compound expression that represents the application of the procedure to those numbers.
fr_fr: Les expressions qui représentent des nombres peuvent être combinées à l'aide d'une expressions représentant une procédure primitive (telle que + ou *) pour former une expression composée qui représente l'application d'une procédure à ces nombres.

source: Expressions such as these, formed by delimiting a list of expressions within parentheses in order to denote procedure application, are called combinations.
fr_fr: Ces expressions, constituées en limitant une liste d'expressions entre parenthèses de manière à indiquer l'application d'une procédure sont appelées des combinaisons.

source: First, observe that the first step dictates that in order to accomplish the evaluation process for a combination we must first perform the evaluation process on each element of the combination.
fr_fr: En premier, il faut observer que la première étape spécifie que pour accomplir le processus d'évaluation pour une combinaison, nous devons effectuer ce processus d'évaluation sur chaque élément de la combinaison.

source: For compound procedures, the application process is as follows:
fr_fr: Pour les procédures composées, le processus d'application est le suivant :

source: For example, x2 + y2 can be expressed as
fr_fr: Par exemple, x2 + y2 peut être exprimé ainsi

source: For example, evaluating
fr_fr: Par exemple, l'évaluation de

source: For example:
fr_fr: Par exemple :

source: For instance, evaluating (define x 3) does not apply define to two arguments, one of which is the value of the symbol x and the other of which is 3, since the purpose of the define is precisely to associate x with a value.
fr_fr: Par exemple, l'évaluation de (define x 3) n'applique pas define aux deux arguments dont l'un est le symbole x et l'autre puisque la fonction de define est précisément d'associer x à une valeur.

source: For instance, we cannot define a procedure that computes the absolute value of a number by testing whether the number is positive, negative, or zero and taking different actions in the different cases according to the rule
fr_fr: Par exemple, nous ne pouvons par définir de procédure qui calcule la valeur absolue d'un nombre en testant si le nombre est positif, négatif ou égal à zéro et en effectuant des actions différentes selon les cas.

source: Harold Abelson and Gerald Jay Sussman
fr_fr: Harold Abelson et Gerald Jay Sussman

source: Having defined square, we can now use it:
fr_fr: Nous avons défini carré, nous pouvons maintenant l'utiliser :

source: He defines the following two procedures:
fr_fr: Il définit les deux procédures suivantes :

source: Here are further examples of the use of define:
fr_fr: Voici d'autres exemples d'utilisation de define :

source: Here is yet another way to write the absolute-value procedure:
fr_fr: Voici encore une autre manière d'écrire la procédure valeur-absolue :

source: However, there are two points that should be stressed:
fr_fr: Cependant, nous devons insister sur deux points :

source: If <p2>'s value is also false, then <p3> is evaluated.
fr_fr: Si la valeur de <p2> est également fausse alors <p3> est évaluée.

source: If all <e>'s evaluate to false, the value of the or expression is false.
fr_fr: Si toutes les <e> s'évaluent à faux, la valeur de l'expression or est faux.

source: If all <e>'s evaluate to true values, the value of the and expression is the value of the last one.
fr_fr: Si toutes les <e> s'évaluent à des valeurs vraies, la valeur de l'expression and est la valeur de la dernière.

source: If any <e> evaluates to a true value, that value is returned as the value of the or expression, and the rest of the <e>'s are not evaluated.
fr_fr: Si une <e> s'évalue à une valeur vrai, cette valeur est retournée en tant que valeur de l'expression or et le reste des <e> ne sont pas évaluées.

source: If any <e> evaluates to false, the value of the and expression is false, and the rest of the <e>'s are not evaluated.
fr_fr: Si une <e> s'évalue à faux, la valeur de l'expression and est fausse et le reste des <e> ne sont pas évaluées.

source: If its value is false, then <p2> is evaluated.
fr_fr: Si sa valeur est fausse alors <p2> est évalué.

source: If none of the <p>'s is found to be true, the value of the cond is undefined.
fr_fr: Si aucune des <p> n'est vraie alors la valeur de cond est indéfinie.

source: If the <predicate> evaluates to a true value, the interpreter then evaluates the <consequent> and returns its value.
fr_fr: Si la <proposition> s'évalue à une valeur vraie alors l'interpréteur évalue la <conséquence> et retourne sa valeur.

source: If we use the definition of square, this reduces to
fr_fr: Si nous utilisons la définition de carré, nous réduisons ceci à

source: If we used this method, the evaluation of
fr_fr: Avec cette méthode, l'évaluation de

source: Imagine that you are sitting at a computer terminal.
fr_fr: Imaginez-vous assis devant un ordinateur.

source: In addition to primitive predicates such as <, =, and >, there are logical composition operations, which enable us to construct compound predicates.
fr_fr: En plus des propositions primitives tels que <, = et >, il existe des opérations de composition logiques qui nous permettent de construire des propositions composées.

source: In an interactive language such as Lisp, it is meaningless to speak of the value of an expression such as (+ x 1) without specifying any information about the environment that would provide a meaning for the symbol x (or even for the symbol +).
fr_fr: Dans un langage interactif tel que Lisp, parler de la valeur d'une expression telle que (+ x 1) sans donner d'information au sujet de l'environnement qui définisse le symbole x (ou même le symbole +) n'a pas de sens.

source: In comparison with most other programming languages, Lisp has a very simple syntax; that is, the evaluation rule for expressions can be described by a simple general rule together with specialized rules for a small number of special forms.11
fr_fr: Comparé à d'autres langages de programmation, Lisp a une syntaxe très simple ; la règle d'évaluation des expressions peut être décrite à l'aide d'une règle générale simple et de règles spéciales pour un petit nombre de formes spéciales.11

source: In fact, any expression that always evaluates to a true value could be used as the <p> here.
fr_fr: En fait, toute expression qui s'évalue toujours à une valeur vraie peut être utilisée en tant que <p> ici.

source: In fact, the ``percolate values upward'' form of the evaluation rule is an example of a general kind of process known as tree accumulation.
fr_fr: De fait, la « remontée des valeurs vers le haut » lors de l'évaluation est un exemple d'un type général de processus connu sous le nom de accumulation ***.

source: In general, computational objects may have very complex structures, and it would be extremely inconvenient to have to remember and repeat their details each time we want to use them.
fr_fr: En général, les objets informatiques peuvent avoir des structures très complexes et il serait très peu pratique d'avoir à se souvenir et à reproduire leurs détails à chaque fois que nous voulons les utiliser.

source: In general, we shall see that recursion is a very powerful technique for dealing with hierarchical, treelike objects.
fr_fr: D'une manière générale, nous verrons que la récursion est une technique très puissante pour traiter des objets hiérarchiques sous formes d'arbres.

source: In general, when modeling phenomena in science and engineering, we begin with simplified, incomplete models.
fr_fr: En général, quand on modélise des phénomènes en sciences ou en ingénierie, on commence par des modèles simples et incomplets.

source: In particular, the evaluations of (+ 5 1) and (* 5 2) are each performed twice here, corresponding to the reduction of the expression
fr_fr: En particulier, les évaluations de (+ 5 1) et (* 5 2) sont effectuées deux fois lors de la réduction de l'expression

source: In particular, when we address in chapter 3 the use of procedures with ``mutable data,'' we will see that the substitution model breaks down and must be replaced by a more complicated model of procedure application.15
fr_fr: En particulier, quand nous aborderons l'utilisation des procédures avec des « données mutables » au chapitre 3, nous verrons que le modèle de substitution ne fonctionne plus et doit être remplacé par un modèle plus complexe d'application de procédure.15

source: In practice, the ``substitution'' is accomplished by using a local environment for the formal parameters.
fr_fr: En pratique, la « substitution » est accomplie en utilisant un environnent local pour les paramètres formels.

source: In programming, we deal with two kinds of elements: procedures and data.
fr_fr: La programmation travaille sur deux types d'éléments : les procédures et les données.

source: In the Scheme dialect of Lisp, we name things with define.
fr_fr: Dans le dialecte de Lisp, Scheme, les choses sont nommés à l'aide de define.

source: In this chapter we will deal only with simple numerical data so that we can focus on the rules for building procedures.4 In later chapters we will see that these same rules allow us to build procedures to manipulate compound data as well.
fr_fr: Dans ce chapitre nous nous intéresserons à des données numériques simples de manière à nous concentrer sur les règles de création des procédures.4 Dans les chapitres suivants nous verrons que les mêmes règles nous permettent de créer des procédures pour manipuler également des données composites.

source: Indeed, complex programs are constructed by building, step by step, computational objects of increasing complexity.
fr_fr: En fait, les programmes complexes sont construits en créant pas à pas des objets informatiques de complexité croissante.

source: Indeed, one could not tell by looking at the definition of sum-of-squares given above whether square was built into the interpreter, like + and *, or defined as a compound procedure.
fr_fr: En fait, il est impossible de dire en regardant la définition de somme-de-carrés donnée plus haut si carré est inclus dans l'interpréteur comme + et * ou défini en tant que procédure composée.

source: Instead it would first substitute operand expressions for parameters until it obtained an expression involving only primitive operators, and would then perform the evaluation.
fr_fr: Il substituerait plutôt les expressions d'opérandes par des paramètres jusqu'à ce qu'il obtienne une expression qui ne contienne que des opérateurs primitifs et effectuerait alors l'évaluation.

source: It can be shown that, for procedure applications that can be modeled using substitution (including all the procedures in the first two chapters of this book) and that yield legitimate values, normal-order and applicative-order evaluation produce the same value.
fr_fr: On peut montrer que pour l'application de procédures qui peuvent être modélisées à l'aide de la substitution (toutes les procédures dans les deux premiers chapitres de ce livre) et qui produisent des valeurs légitimes, l'évaluation en ordre normal et en ordre d'application produisent les mêmes valeurs.
